
INSERT INTO authors
VALUES (1, 'Lady Gaga'),
       (2, 'Кровосток'),
       (3, 'Хаски'),
       (4, 'Слава КПСС'),
       (5, 'Макулатура'),
       (6, 'СМН'),
       (7, 'Борис Гребенщиков'),
       (8, 'Дискотека Авария');


INSERT INTO genres(name)
VALUES ('Электропоп'),
       ('Хип-хоп'),
       ('Рэп'),
       ('Поп'),
       ('Бардовская песня');

INSERT INTO authors_genres
VALUES (1, 1), (1, 4), (2, 2), (2, 3), (3, 3), (3, 2), (4, 3), (5, 3), (6, 4), (7, 5), (8, 4);

INSERT INTO albums(name, edition_year)
VALUES ('Love For Sale', '2021-01-01'),
       ('Born This Way', '2011-01-01'),
       ('Знак огня', '2020-01-01'),
       ('ВЕРНИТЕ МОЙ 2007', '2020-01-01'),
       ('Фантазер', '2018-01-01'),
       ('Студень', '2012-01-01'),
       ('Хошхоног', '2020-01-01'),
       ('Ангельское True', '2022-01-01'),
       ('Место', '2019-01-01');

INSERT INTO albums_authors
VALUES (1, 1), (1, 2), (2, 6), (3, 7), (4, 8), (5, 9), (6, 4), (7, 3), (8, 5);

INSERT INTO tracks (name, duration, album_id)
VALUES ( 'Its De-Lovely', 173, 1),
       ('I get a kick out of you', 213, 1),
       ('Born This Way', 268, 2),
       ('Hair', 308, 2),
       ('Мое имя пыль', 206, 3),
       ('Хиханьки да хаханьки', 42, 3),
       ('Верните мой 2007', 173, 4),
       ('Фантазер', 192, 5),
       ('Память', 179, 6),
       ('Цветы в вазе', 142, 6),
       ('Ребята', 141, 6),
       ('На что я дрочу', 228, 7),
       ('Мир мух', 265, 7),
       ('Биография', 303, 8),
       ('Шизодискотека', 137, 8),
       ('Все включено', 231, 9),
       ('реп', 288, 9);


INSERT INTO collection(name, edition_year)
VALUES ('Сборник 1', '2015-01-01'),
       ('Сборник 2', '2016-01-01'),
       ('Сборник 3', '2017-01-01'),
       ('Сборник 4', '2020-01-01'),
       ('Сборник 5', '2021-01-01'),
       ('Сборник 6', '2019-01-01');


INSERT INTO collection_tracks
VALUES (1, 1), (1, 2), (1, 5), (2, 5), (2, 1), (3, 1), (3, 2), (4, 16), (4, 10), (4, 15), (4, 5), (5, 11), (5, 5), (5, 14), (5, 12), (6, 10), (6, 4), (6, 2);
